{"id":2504,"date":"2021-08-25T12:16:13","date_gmt":"2021-08-25T12:16:13","guid":{"rendered":"http:\/\/blog.jumpshare.com\/?p=2504"},"modified":"2021-08-25T12:16:13","modified_gmt":"2021-08-25T12:16:13","slug":"how-to-screen-record-your-online-course-videos-with-jumpshare","status":"publish","type":"post","link":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/","title":{"rendered":"How to screen record your online course videos with Jumpshare"},"content":{"rendered":"\n<p>Video lectures are increasingly becoming the go-to method for knowledge sharing on the internet. They don’t require you to show up for classes, they possess longevity, and are easily scalable.<\/p>\n\n\n\n<p>You could be sipping pina coladas in the Bahamas while learners purchase and study your recorded lectures – that’s money in the bank and more days off for you.<\/p>\n\n\n\n<p>When it comes to creating recorded courses, there are several kinds of video lectures and recorded courses options to choose from. But so far, the most popular ones feature the following elements:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Slides\/presentation<\/li><li>Presence of the instructor via webcam and audio<\/li><\/ul>\n\n\n\n<p>Another common element of such courses are the <strong>screen recording tools<\/strong>. The wrong kind of tools can take money from your pocket, and worst of all, waste your time and effort. Not to worry, however, <a href=\"https:\/\/jumpshare.com\/\">Jumpshare<\/a> has enabled thousands of people to screen record their courses, and we’re going to tell you how to do that.<\/p>\n\n\n\n<!--more-->\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh6.googleusercontent.com\/GR3yi5ouHG-Sh7CoXneZucUeFpy_ROoBYXsJuMPYoegb08QoXfL6__ixtwzqs0FYMP0YHBC5gjZSIrfgDyG00GVpIKmANoRDpe4lZcf3MoxEwEORJRgnniljF8q2kRZtRG944wHl\" alt=\"\"\/><\/figure>\n\n\n\n<p>While video-based, recorded courses may look a little intimidating to make as a first-timer, not much has to change from a regular Zoom class. In fact, owing to the nature of video lectures, they only add improvements to the former and make for a more enhanced teaching experience. And so, without further ado, <strong>here’s how to screen record your online courses using Jumpshare:<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Before course recording<\/strong><\/h2>\n\n\n\n<p>If you’ve completed this step, you may skip to the next. But if you have no idea where to start, let’s first walk you through some crucial steps. This is before you start recording your course. <\/p>\n\n\n\n<h1 class=\"wp-block-heading\">1 &#8211; Devise a course curriculumn<\/h1>\n\n\n\n<p>Before you set on creating slides for your course, make sure you’ve researched your learner persona, know their pain points, and can provide solutions through your course material. Figure out the progression of your lectures, and plan material and activities around them. Once you have devised the <a href=\"https:\/\/airschool.com\/articles\/create-online-course-curriculum\/\">course curriculum<\/a>, it&#8217;s time to move to the next step.<br><\/p>\n\n\n\n<h1 class=\"wp-block-heading\">2 &#8211; Build your presentation<\/h1>\n\n\n\n<p>Separate all your lectures into different presentations or make one big presentation including your entire course material. Line them up by order, and then review the lineup in case you missed something.&nbsp;<\/p>\n\n\n\n<p><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/lh6.googleusercontent.com\/g8GBlXmyBTUELh9L2UCk6tNHMnz12cHF_uw6D_VpRE3x79ZU2aShGtCDqkiez2JrhDvhNxdZ1Iex2N9xh7oUyTodWfNagxcoutfvIxdchKJoqPDxoDawF1RbcDv3I1HLtDA6otPo\" width=\"624\" height=\"351\"><br><br>Make sure they’re not text-heavy, include visuals to describe several concepts, even add trivia and memes to make content consumable. Preparing slides in advance can help you structure your lectures, cut out the unnecessary stuff, thus maximizing the learning experience.<br><\/p>\n\n\n\n<h1 class=\"wp-block-heading\">3 &#8211; Write a rough script<\/h1>\n\n\n\n<p>If you were to read straight from slides in a recorded course, students would question the quality of your course and even your credibility. The solution to this, again, is planning in advance. Verbally rehearse your slides before recording them.&nbsp;<\/p>\n\n\n\n<p>This will help you take notes, and also help you insert some discussion points or examples that can be explained without adding to slides. Take each lecture one by one, and try not to get overwhelmed.&nbsp;<\/p>\n\n\n\n<h1 class=\"wp-block-heading\"><strong>During course recording&nbsp;<\/strong><\/h1>\n\n\n\n<h1 class=\"wp-block-heading\">4 &#8211; Download Jumpshare for course recordings<\/h1>\n\n\n\n<p>Jumpshare is quite popular among the course creator community as a screen recording tool. It has all the features needed to make a stellar recorded course in record time.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh3.googleusercontent.com\/hQJ_QSE-V7sqJyO7yE5UmkvsqcxmTo1tgRVKX-rwbffSRqqFatpghggIA7rZU11jAJgrOhqjh_aJ14V2_SPEU3953VvFySC6JXPNyPGUkwwSMRFVjt7FKlYbecTEPZzhTZMSHhti\" alt=\"\"\/><\/figure>\n\n\n\n<p>While there is a forever free plan users can avail, its screen recording time is only 30 seconds long. In order to make optimal under-6 minute lecture videos each, course creators usually purchase the $8.5 <a href=\"https:\/\/jumpshare.com\/pricing\">Plus Plan<\/a> at Jumpshare. With the plan they are able to unlock several great features, worry less about the technicalities, and focus more on course delivery.&nbsp;<\/p>\n\n\n\n<p>Jumpshare is an easy <a href=\"https:\/\/jumpshare.com\/downloading\">download<\/a> away. Install and run it on your computer. Sign in and test its functions. Then according to your convenience, upgrade your account according to your needs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">5 &#8211; Sit in a quiet, comfortable environment&nbsp;<\/h2>\n\n\n\n<p>A great deal of good and bad recorded courses do the rounds online. However, we want your course to be great. So be mindful of your environment. There are several factors that can deteriorate the quality of your recorded course.&nbsp;<\/p>\n\n\n\n<p>Like noise, for instance. Be sure to sit in a secluded spot of your residence or office, away from distractions like people talking and horns beeping in the background. Not only will you be distracted, but your students may also get irritated and confused.&nbsp;<\/p>\n\n\n\n<p>Moreover, be certain about your surroundings. You don’t want to sit in front of a wall with a rock band poster pasted in the back. Not only would that be distracting, but your students won’t take you seriously and your professionalism may come into question. Instead choose a light, plain wall to sit in front of without any clutter showing in the cam.&nbsp;<\/p>\n\n\n\n<p>Also make sure that you and your device (laptop, desktop) are at level with you, and that you’re not sitting in an uncomfortable chair. Students might be able to see your unease, and you should be able to deliver your lecture without being in pain.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">6 &#8211; Ensure lighting and appearance, both, are on point&nbsp;<\/h2>\n\n\n\n<p>Being clearly seen is super important in maintaining a professional outlook of you and your course. If you’re spending time delivering a course that explains everything properly, taking care of factors like lighting and appearance will only spruce it up.&nbsp;<\/p>\n\n\n\n<p>So make sure your webcam is clean. Put on fresh and ironed clothes, brush your hair, and look the part. And finally see if where you are sitting isn’t under or over exposing your video. To give you an idea, some people start recording when they’re sitting against a window. Or over a low lamp. Don’t make that mistake.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">7 &#8211; Share your screen, switch on your webcam<\/h2>\n\n\n\n<p>Whether you have a presentation to show or multiple things (videos, articles, images via your browser), line all of them up. The next thing to do is go to the Jumpshare application from the icons on the bottom corner of your computer. Click on the Jumpshare icon and access the video recording icon there or enter Alt+Shift+2.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/wBOyx9cJVUnGlxra_IBOKHIumFQxG3pRNes7xhfvH-bGUdWuyEmGm5XOhm6NinKcD2pw9QH_f5SI5ZGh9lvw-7P-X7qpYZirG-fm1vhQ0vL73T4rYOz4mQ-_0SjGeAxDki8zV9eo\" alt=\"\"\/><\/figure>\n\n\n\n<p>Doing that will give you an option to set your screen recorder dimensions. You can extend it all the way to the corners of the screen, or capture spaces within tabs. Then compose yourself and start recording.&nbsp;<\/p>\n\n\n\n<p>Keep learners engaged throughout the session by speaking into the video and using the click tracking tool to move around the webcam display. Even try drawing on the screen with the draw tool. It’s a customer favorite as it helps emphasize important information and makes courses more interactive. Discover more <a href=\"https:\/\/jumpshare.com\/screen-recorder\">Jumpshare features<\/a>.&nbsp;<\/p>\n\n\n\n<p>For course creators it’s super important to have all their recorded lectures prepared on time. Jumpshare is able to accomplish that for them. It solves several pain points in one go. Which is why they don’t mind paying a small subscription fee.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">8 &#8211; Try to keep video under 6 minutes<br><\/h2>\n\n\n\n<p>6.9 million video sessions were <a href=\"http:\/\/up.csail.mit.edu\/other-pubs\/las2014-pguo-engagement.pdf\">studied<\/a> to find the optimal course video length, and there’s a magic number to keep learner engagement alive. <strong>It’s six minutes and under.<\/strong> Discuss the important stuff and get straight to the meat of the lecture or your students may skip over the ‘boring’ parts. Saves them time and saves you time.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">9 &#8211; Show enthusiasm<\/h2>\n\n\n\n<p>Try to look and sound excited when teaching your course. Considering recorded lectures are not two-way lectures, they require you to keep learners attentive. Moreover, don’t try to speed through the course and speak quickly &#8211; talk in a way your students can follow what you’re saying.&nbsp;<\/p>\n\n\n\n<p>Also don’t forget to take breaks. You can pause your video recordings, drink water in between, and continue with your course video.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">10 &#8211; Don’t forget to make eye contact with your learners<\/h2>\n\n\n\n<p>Recorded or asynchronous courses are at higher risk of boring learners. By switching on the webcam and featuring in your videos, you are engaging the learners. But to engage them more, talk into the camera. Eye contact is an extremely important aspect of cultivating learner engagement.&nbsp;<\/p>\n\n\n\n<p>Learners should be aware you are attentive, addressing them,&nbsp; and simultaneously commanding attention. To aid that, keep your voice high and confident, and feel free to use hand gestures to explain stuff.&nbsp;<\/p>\n\n\n\n<p>Moreover, to make learners feel like they’re an active participant of your course (even though they’re not) ask questions, give them some time to think of their answers. Take pauses and give them some time to look back at what they’ve learnt.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">11 &#8211; Start every video with a summary of the previous lecture, and at the end tell what’s coming next<\/h2>\n\n\n\n<p>And lastly, remember to do a recap of your previous lecture at the start of a new lecture. Line them up in your presentation and walk them through it. Doing so would reinforce older concepts. As you go forward, perhaps even use the draw tool on Jumpshare to tick mark all completed topics.&nbsp;<\/p>\n\n\n\n<p>Similarly, at the end of your lecture, give them a bite of what to expect in the next lecture. Explain in summary style but have it written down for the students to follow on-screen.&nbsp;<\/p>\n\n\n\n<h1 class=\"wp-block-heading\"><strong>After course recording<\/strong><\/h1>\n\n\n\n<h2 class=\"wp-block-heading\">12 &#8211; Upload your screen recorded lectures to a course platform<\/h2>\n\n\n\n<p>Once you’re done recording your lectures and edits are final, there comes the question of where to upload them. Sure, you could probably try to upload them to YouTube or some streaming service where you have total control.&nbsp;<\/p>\n\n\n\n<p>But if you were to do so, when your students go from 15 to 30, it’ll get difficult to track. More importantly, it would get difficult to process payments, set up landing pages, and look at analytics. That’s why, several online course hosting platforms have popped up in the past.&nbsp;<\/p>\n\n\n\n<p>Most of the people we know of have recently shifted to <a href=\"https:\/\/airschool.com\/\">Airschool<\/a>. There’s a reason. Most apps like Kajabi, Thinkific, Teachable have subscription-based models, taking an average of $30 from you. The numbers can go up based on several factors and features, even up to a $1,000.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh3.googleusercontent.com\/GXhEveJPtCGoj3q6-N0Dhc8b63axPN6jyQ9YSoS_LNJQmE4XhQMZ73qaxssWy9s9_REc00EsHX2HN6cpvf-M4tFOAGakDhxgDlZGWUPVgSdBmw2aQI-nTFKM5L92vnuUCYsnZh_e\" alt=\"\"\/><\/figure>\n\n\n\n<p>If you don’t want to splurge, be assured there are platforms like Airschool around, ones that have no subscriptions but a <a href=\"https:\/\/airschool.com\/pricing\">commission-based model<\/a>. What this means is that you only give away a small portion of your sales, that too when you make a sale. That’s a win-win.<\/p>\n\n\n\n<p>It can certainly make matters less stressful and doesn’t take money out of your pocket when you’re only just creating your course or if sales have slowed down. In the meantime you can gain access to similar, sometimes even more features available on the more popular platforms in the west.<\/p>\n\n\n\n<p>Hoping this helps simplify how to screen record your online course. Craft a plan, download Jumpshare, shoot, and announce your knowledge product to the world. Good luck!<\/p>\n\n\n\n<p><em>This is a guest blog post written by Sinwan Zahid of AirSchool<\/em>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Video lectures are increasingly becoming the go-to method for knowledge sharing on the internet. They don’t require you to show up for classes, they possess longevity, and are easily scalable. You could be sipping pina coladas in the Bahamas while learners purchase and study your recorded lectures – that’s money in the bank and more [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2634,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-2504","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-product-updates"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to screen record your online course videos with Jumpshare<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to screen record your online course videos with Jumpshare\" \/>\n<meta property=\"og:description\" content=\"Video lectures are increasingly becoming the go-to method for knowledge sharing on the internet. They don’t require you to show up for classes, they possess longevity, and are easily scalable. You could be sipping pina coladas in the Bahamas while learners purchase and study your recorded lectures – that’s money in the bank and more [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\" \/>\n<meta property=\"og:site_name\" content=\"Jumpshare Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/facebook.com\/jumpshare\" \/>\n<meta property=\"article:published_time\" content=\"2021-08-25T12:16:13+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lh6.googleusercontent.com\/GR3yi5ouHG-Sh7CoXneZucUeFpy_ROoBYXsJuMPYoegb08QoXfL6__ixtwzqs0FYMP0YHBC5gjZSIrfgDyG00GVpIKmANoRDpe4lZcf3MoxEwEORJRgnniljF8q2kRZtRG944wHl\" \/>\n<meta name=\"author\" content=\"nakodari\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@jumpshare\" \/>\n<meta name=\"twitter:site\" content=\"@jumpshare\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"nakodari\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\"},\"author\":{\"name\":\"nakodari\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/0e0b4f56d92eb3924bff8460bf2ca9eb\"},\"headline\":\"How to screen record your online course videos with Jumpshare\",\"datePublished\":\"2021-08-25T12:16:13+00:00\",\"dateModified\":\"2021-08-25T12:16:13+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\"},\"wordCount\":1835,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/#organization\"},\"articleSection\":[\"Product Updates\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\",\"url\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\",\"name\":\"How to screen record your online course videos with Jumpshare\",\"isPartOf\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/#website\"},\"datePublished\":\"2021-08-25T12:16:13+00:00\",\"dateModified\":\"2021-08-25T12:16:13+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/jumpshare.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to screen record your online course videos with Jumpshare\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#website\",\"url\":\"https:\/\/jumpshare.com\/blog\/\",\"name\":\"Jumpshare Blog\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/jumpshare.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#organization\",\"name\":\"Jumpshare\",\"url\":\"https:\/\/jumpshare.com\/blog\/\",\"sameAs\":[\"https:\/\/facebook.com\/jumpshare\",\"https:\/\/twitter.com\/jumpshare\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/blog-cdn.jumpshare.com\/blog\/wp-content\/uploads\/2022\/05\/Logo-white-new.png\",\"contentUrl\":\"https:\/\/blog-cdn.jumpshare.com\/blog\/wp-content\/uploads\/2022\/05\/Logo-white-new.png\",\"width\":2164,\"height\":572,\"caption\":\"Jumpshare\"},\"image\":{\"@id\":\"https:\/\/jumpshare.com\/blog\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/0e0b4f56d92eb3924bff8460bf2ca9eb\",\"name\":\"nakodari\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/56686f39b61baf1c23deed90c5732244?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/56686f39b61baf1c23deed90c5732244?s=96&d=mm&r=g\",\"caption\":\"nakodari\"},\"sameAs\":[\"https:\/\/jumpshare.com\/blog\"],\"url\":\"https:\/\/jumpshare.com\/blog\/author\/nakodari\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to screen record your online course videos with Jumpshare","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/","og_locale":"en_US","og_type":"article","og_title":"How to screen record your online course videos with Jumpshare","og_description":"Video lectures are increasingly becoming the go-to method for knowledge sharing on the internet. They don’t require you to show up for classes, they possess longevity, and are easily scalable. You could be sipping pina coladas in the Bahamas while learners purchase and study your recorded lectures – that’s money in the bank and more [&hellip;]","og_url":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/","og_site_name":"Jumpshare Blog","article_publisher":"https:\/\/facebook.com\/jumpshare","article_published_time":"2021-08-25T12:16:13+00:00","og_image":[{"url":"https:\/\/lh6.googleusercontent.com\/GR3yi5ouHG-Sh7CoXneZucUeFpy_ROoBYXsJuMPYoegb08QoXfL6__ixtwzqs0FYMP0YHBC5gjZSIrfgDyG00GVpIKmANoRDpe4lZcf3MoxEwEORJRgnniljF8q2kRZtRG944wHl"}],"author":"nakodari","twitter_card":"summary_large_image","twitter_creator":"@jumpshare","twitter_site":"@jumpshare","twitter_misc":{"Written by":"nakodari","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#article","isPartOf":{"@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/"},"author":{"name":"nakodari","@id":"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/0e0b4f56d92eb3924bff8460bf2ca9eb"},"headline":"How to screen record your online course videos with Jumpshare","datePublished":"2021-08-25T12:16:13+00:00","dateModified":"2021-08-25T12:16:13+00:00","mainEntityOfPage":{"@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/"},"wordCount":1835,"commentCount":0,"publisher":{"@id":"https:\/\/jumpshare.com\/blog\/#organization"},"articleSection":["Product Updates"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/","url":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/","name":"How to screen record your online course videos with Jumpshare","isPartOf":{"@id":"https:\/\/jumpshare.com\/blog\/#website"},"datePublished":"2021-08-25T12:16:13+00:00","dateModified":"2021-08-25T12:16:13+00:00","breadcrumb":{"@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/jumpshare.com\/blog\/how-to-screen-record-your-online-course-videos-with-jumpshare\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/jumpshare.com\/blog\/"},{"@type":"ListItem","position":2,"name":"How to screen record your online course videos with Jumpshare"}]},{"@type":"WebSite","@id":"https:\/\/jumpshare.com\/blog\/#website","url":"https:\/\/jumpshare.com\/blog\/","name":"Jumpshare Blog","description":"","publisher":{"@id":"https:\/\/jumpshare.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/jumpshare.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/jumpshare.com\/blog\/#organization","name":"Jumpshare","url":"https:\/\/jumpshare.com\/blog\/","sameAs":["https:\/\/facebook.com\/jumpshare","https:\/\/twitter.com\/jumpshare"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/jumpshare.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/blog-cdn.jumpshare.com\/blog\/wp-content\/uploads\/2022\/05\/Logo-white-new.png","contentUrl":"https:\/\/blog-cdn.jumpshare.com\/blog\/wp-content\/uploads\/2022\/05\/Logo-white-new.png","width":2164,"height":572,"caption":"Jumpshare"},"image":{"@id":"https:\/\/jumpshare.com\/blog\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/0e0b4f56d92eb3924bff8460bf2ca9eb","name":"nakodari","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/jumpshare.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/56686f39b61baf1c23deed90c5732244?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/56686f39b61baf1c23deed90c5732244?s=96&d=mm&r=g","caption":"nakodari"},"sameAs":["https:\/\/jumpshare.com\/blog"],"url":"https:\/\/jumpshare.com\/blog\/author\/nakodari\/"}]}},"jetpack_featured_media_url":"https:\/\/jumpshare.com\/blog\/wp-content\/uploads\/2022\/09\/GR3yi5ouHG-Sh7CoXneZucUeFpy_ROoBYXsJuMPYoegb08QoXfL6__ixtwzqs0FYMP0YHBC5gjZSIrfgDyG00GVpIKmANoRDpe4lZcf3MoxEwEORJRgnniljF8q2kRZtRG944wHl","_links":{"self":[{"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/posts\/2504"}],"collection":[{"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/comments?post=2504"}],"version-history":[{"count":1,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/posts\/2504\/revisions"}],"predecessor-version":[{"id":2781,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/posts\/2504\/revisions\/2781"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/media\/2634"}],"wp:attachment":[{"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/media?parent=2504"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/categories?post=2504"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/jumpshare.com\/blog\/wp-json\/wp\/v2\/tags?post=2504"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}